---
title: CreationFailures
classe: Autodesk.Revit.DB.BuiltInFailures+CreationFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 64
---

# CreationFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCreateCornice { get; }` | `CreationFailures.CannotCreateCornice` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCorniceError { get; }` | `CreationFailures.CannotCreateCorniceError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCorniceIntegral { get; }` | `CreationFailures.CannotCreateCorniceIntegral` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCorniceIntegralError { get; }` | `CreationFailures.CannotCreateCorniceIntegralError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCorniceIntegralWarn { get; }` | `CreationFailures.CannotCreateCorniceIntegralWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCorniceWarn { get; }` | `CreationFailures.CannotCreateCorniceWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCurtainGrid { get; }` | `CreationFailures.CannotCreateCurtainGrid` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCutout { get; }` | `CreationFailures.CannotCreateCutout` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCutoutError { get; }` | `CreationFailures.CannotCreateCutoutError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateCutoutWarn { get; }` | `CreationFailures.CannotCreateCutoutWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateElementInFamily { get; }` | `CreationFailures.CannotCreateElementInFamily` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateElementInView { get; }` | `CreationFailures.CannotCreateElementInView` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateExplicitCrease { get; }` | `CreationFailures.CannotCreateExplicitCrease` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateFascia { get; }` | `CreationFailures.CannotCreateFascia` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateFasciaError { get; }` | `CreationFailures.CannotCreateFasciaError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateFasciaWarn { get; }` | `CreationFailures.CannotCreateFasciaWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateGutter { get; }` | `CreationFailures.CannotCreateGutter` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateGutterError { get; }` | `CreationFailures.CannotCreateGutterError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateGutterWarn { get; }` | `CreationFailures.CannotCreateGutterWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMullion { get; }` | `CreationFailures.CannotCreateMullion` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMullionError { get; }` | `CreationFailures.CannotCreateMullionError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMullionReference { get; }` | `CreationFailures.CannotCreateMullionReference` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateMullionReferenceNoGeometry { get; }` | `CreationFailures.CannotCreateMullionReferenceNoGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateNewDesignOption { get; }` | `CreationFailures.CannotCreateNewDesignOption` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOldCornerMullion { get; }` | `CreationFailures.CannotCreateOldCornerMullion` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOpening { get; }` | `CreationFailures.CannotCreateOpening` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOpeningCutOut { get; }` | `CreationFailures.CannotCreateOpeningCutOut` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateOpeningRectangularArcWall { get; }` | `CreationFailures.CannotCreateOpeningRectangularArcWall` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateReveal { get; }` | `CreationFailures.CannotCreateReveal` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRevealError { get; }` | `CreationFailures.CannotCreateRevealError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRevealIntegral { get; }` | `CreationFailures.CannotCreateRevealIntegral` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRevealIntegralError { get; }` | `CreationFailures.CannotCreateRevealIntegralError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRevealIntegralWarn { get; }` | `CreationFailures.CannotCreateRevealIntegralWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateRevealWarn { get; }` | `CreationFailures.CannotCreateRevealWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSlabEdge { get; }` | `CreationFailures.CannotCreateSlabEdge` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSlabEdgeError { get; }` | `CreationFailures.CannotCreateSlabEdgeError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSlabEdgeWarn { get; }` | `CreationFailures.CannotCreateSlabEdgeWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSlantedWallWithSingularLayers { get; }` | `CreationFailures.CannotCreateSlantedWallWithSingularLayers` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSlantedWallWithSingularLayersError { get; }` | `CreationFailures.CannotCreateSlantedWallWithSingularLayersError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateSystemPanel { get; }` | `CreationFailures.CannotCreateSystemPanel` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateTaperedWallForWallType { get; }` | `CreationFailures.CannotCreateTaperedWallForWallType` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateTaperedWallForWallTypeError { get; }` | `CreationFailures.CannotCreateTaperedWallForWallTypeError` | FailureDefinitionId |
| `FailureDefinitionId CannotCreateThis { get; }` | `CreationFailures.CannotCreateThis` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawProfileRoof { get; }` | `CreationFailures.CannotDrawProfileRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawRoof { get; }` | `CreationFailures.CannotDrawRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawRoofError { get; }` | `CreationFailures.CannotDrawRoofError` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawRoofWall { get; }` | `CreationFailures.CannotDrawRoofWall` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawSingularSlantedWall { get; }` | `CreationFailures.CannotDrawSingularSlantedWall` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawSingularSlantedWallError { get; }` | `CreationFailures.CannotDrawSingularSlantedWallError` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawToposolid { get; }` | `CreationFailures.CannotDrawToposolid` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawToposolidError { get; }` | `CreationFailures.CannotDrawToposolidError` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawWalls { get; }` | `CreationFailures.CannotDrawWalls` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawWallsError { get; }` | `CreationFailures.CannotDrawWallsError` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeRoofFromVerticalFace { get; }` | `CreationFailures.CannotMakeRoofFromVerticalFace` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeRoofFromVerticalFaceError { get; }` | `CreationFailures.CannotMakeRoofFromVerticalFaceError` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeSurface { get; }` | `CreationFailures.CannotMakeSurface` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeSurfaceError { get; }` | `CreationFailures.CannotMakeSurfaceError` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeSurfaceWarn { get; }` | `CreationFailures.CannotMakeSurfaceWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeToposolid { get; }` | `CreationFailures.CannotMakeToposolid` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeToposolidFromVerticalFace { get; }` | `CreationFailures.CannotMakeToposolidFromVerticalFace` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeToposolidFromVerticalFaceError { get; }` | `CreationFailures.CannotMakeToposolidFromVerticalFaceError` | FailureDefinitionId |
| `FailureDefinitionId CannotMakeWall { get; }` | `CreationFailures.CannotMakeWall` | FailureDefinitionId |
| `FailureDefinitionId CannotUpdateWall { get; }` | `CreationFailures.CannotUpdateWall` | FailureDefinitionId |
| `FailureDefinitionId SwitchFromLegendBeforeCreateSimilar { get; }` | `CreationFailures.SwitchFromLegendBeforeCreateSimilar` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```